01  WS-AREA. 
    05  WS-VALUE PIC 9(5) VALUE 0. 
    05  WS-FLAG PIC X VALUE 'N'.

PROCEDURE DIVISION.

    PERFORM 100-INITIALIZE.
    PERFORM 200-PROCESS-DATA.
    PERFORM 300-TERMINATE.

100-INITIALIZE SECTION.
    MOVE ZEROS TO WS-VALUE
    MOVE 'Y' TO WS-FLAG

200-PROCESS-DATA SECTION.
    IF WS-FLAG = 'Y' THEN 
        ADD 1 TO WS-VALUE
        DISPLAY WS-VALUE
        GO TO 200-PROCESS-DATA 
    ELSE
        DISPLAY 'End of Process'
    END-IF

300-TERMINATE SECTION.
    STOP RUN.